ablehobo/anduril2-plus/arch/dfp/avrdd/avrasm/inc/AVR32DB28def.inc
;***** THIS IS A MACHINE GENERATED FILE - DO NOT EDIT ********************

;*************************************************************************
;* A P P L I C A T I O N   N O T E   F O R   T H E   A V R   F A M I L Y
;*
;* Number            : AVR000
;* File Name         : AVR32DB28def.inc
;* Title             : Register/Bit Definitions for the AVR32DB28
;* Created           : 2022-12-16 12:47
;* Version           : 1.00
;* Support           : https://microchipsupport.force.com/
;* Target MCU        : AVR32DB28
;*
;* DESCRIPTION
;* When including this file in the assembly program file, all I/O register
;* names and I/O register bit names appearing in the data book can be used.
;* In addition, the six registers forming the three data pointers X, Y and
;* Z have been assigned names XL - ZH. Highest RAM address for Internal
;* SRAM is also defined
;*
;*************************************************************************

#ifndef _AVR32DB28DEF_INC_
#define _AVR32DB28DEF_INC_


#pragma partinc 0

; ***** SPECIFY DEVICE ***************************************************
.device	AVR32DB28

#pragma AVRPART ADMIN PART_NAME AVR32DB28

.equ	SIGNATURE_000	= 0x1E
.equ	SIGNATURE_001	= 0x95
.equ	SIGNATURE_002	= 0x37

#pragma AVRPART CORE CORE_VERSION V4S


; ***** ABSOLUTE I/O REGISTER LOCATIONS **********************************


;*************************************************************************
;** AC0 - Analog Comparator
;*************************************************************************

.equ AC0_CTRLA = 0x0680                  ; Control A
.equ AC0_CTRLB = 0x0681                  ; Control B
.equ AC0_MUXCTRL = 0x0682                ; Mux Control A
.equ AC0_DACREF = 0x0685                 ; DAC Voltage Reference
.equ AC0_INTCTRL = 0x0686                ; Interrupt Control
.equ AC0_STATUS = 0x0687                 ; Status

;*************************************************************************
;** AC1 - Analog Comparator
;*************************************************************************

.equ AC1_CTRLA = 0x0688                  ; Control A
.equ AC1_CTRLB = 0x0689                  ; Control B
.equ AC1_MUXCTRL = 0x068A                ; Mux Control A
.equ AC1_DACREF = 0x068D                 ; DAC Voltage Reference
.equ AC1_INTCTRL = 0x068E                ; Interrupt Control
.equ AC1_STATUS = 0x068F                 ; Status

;*************************************************************************
;** AC2 - Analog Comparator
;*************************************************************************

.equ AC2_CTRLA = 0x0690                  ; Control A
.equ AC2_CTRLB = 0x0691                  ; Control B
.equ AC2_MUXCTRL = 0x0692                ; Mux Control A
.equ AC2_DACREF = 0x0695                 ; DAC Voltage Reference
.equ AC2_INTCTRL = 0x0696                ; Interrupt Control
.equ AC2_STATUS = 0x0697                 ; Status

;*************************************************************************
;** ADC0 - Analog to Digital Converter
;*************************************************************************

.equ ADC0_CTRLA = 0x0600                 ; Control A
.equ ADC0_CTRLB = 0x0601                 ; Control B
.equ ADC0_CTRLC = 0x0602                 ; Control C
.equ ADC0_CTRLD = 0x0603                 ; Control D
.equ ADC0_CTRLE = 0x0604                 ; Control E
.equ ADC0_SAMPCTRL = 0x0605              ; Sample Control
.equ ADC0_MUXPOS = 0x0608                ; Positive mux input
.equ ADC0_MUXNEG = 0x0609                ; Negative mux input
.equ ADC0_COMMAND = 0x060A               ; Command
.equ ADC0_EVCTRL = 0x060B                ; Event Control
.equ ADC0_INTCTRL = 0x060C               ; Interrupt Control
.equ ADC0_INTFLAGS = 0x060D              ; Interrupt Flags
.equ ADC0_DBGCTRL = 0x060E               ; Debug Control
.equ ADC0_TEMP = 0x060F                  ; Temporary Data
.equ ADC0_RES = 0x0610                   ; ADC Accumulator Result
.equ ADC0_RESL = 0x0610                  ; ADC Accumulator Result low byte
.equ ADC0_RESH = 0x0611                  ; ADC Accumulator Result hi byte
.equ ADC0_WINLT = 0x0612                 ; Window comparator low threshold
.equ ADC0_WINLTL = 0x0612                ; Window comparator low threshold low byte
.equ ADC0_WINLTH = 0x0613                ; Window comparator low threshold hi byte
.equ ADC0_WINHT = 0x0614                 ; Window comparator high threshold
.equ ADC0_WINHTL = 0x0614                ; Window comparator high threshold low byte
.equ ADC0_WINHTH = 0x0615                ; Window comparator high threshold hi byte

;*************************************************************************
;** BOD - Bod interface
;*************************************************************************

.equ BOD_CTRLA = 0x00A0                  ; Control A
.equ BOD_CTRLB = 0x00A1                  ; Control B
.equ BOD_VLMCTRLA = 0x00A8               ; Voltage level monitor Control
.equ BOD_INTCTRL = 0x00A9                ; Voltage level monitor interrupt Control
.equ BOD_INTFLAGS = 0x00AA               ; Voltage level monitor interrupt Flags
.equ BOD_STATUS = 0x00AB                 ; Voltage level monitor status

;*************************************************************************
;** CCL - Configurable Custom Logic
;*************************************************************************

.equ CCL_CTRLA = 0x01C0                  ; Control Register A
.equ CCL_SEQCTRL0 = 0x01C1               ; Sequential Control 0
.equ CCL_SEQCTRL1 = 0x01C2               ; Sequential Control 1
.equ CCL_INTCTRL0 = 0x01C5               ; Interrupt Control 0
.equ CCL_INTFLAGS = 0x01C7               ; Interrupt Flags
.equ CCL_LUT0CTRLA = 0x01C8              ; LUT 0 Control A
.equ CCL_LUT0CTRLB = 0x01C9              ; LUT 0 Control B
.equ CCL_LUT0CTRLC = 0x01CA              ; LUT 0 Control C
.equ CCL_TRUTH0 = 0x01CB                 ; Truth 0
.equ CCL_LUT1CTRLA = 0x01CC              ; LUT 1 Control A
.equ CCL_LUT1CTRLB = 0x01CD              ; LUT 1 Control B
.equ CCL_LUT1CTRLC = 0x01CE              ; LUT 1 Control C
.equ CCL_TRUTH1 = 0x01CF                 ; Truth 1
.equ CCL_LUT2CTRLA = 0x01D0              ; LUT 2 Control A
.equ CCL_LUT2CTRLB = 0x01D1              ; LUT 2 Control B
.equ CCL_LUT2CTRLC = 0x01D2              ; LUT 2 Control C
.equ CCL_TRUTH2 = 0x01D3                 ; Truth 2
.equ CCL_LUT3CTRLA = 0x01D4              ; LUT 3 Control A
.equ CCL_LUT3CTRLB = 0x01D5              ; LUT 3 Control B
.equ CCL_LUT3CTRLC = 0x01D6              ; LUT 3 Control C
.equ CCL_TRUTH3 = 0x01D7                 ; Truth 3

;*************************************************************************
;** CLKCTRL - Clock controller
;*************************************************************************

.equ CLKCTRL_MCLKCTRLA = 0x0060          ; MCLK Control A
.equ CLKCTRL_MCLKCTRLB = 0x0061          ; MCLK Control B
.equ CLKCTRL_MCLKCTRLC = 0x0062          ; MCLK Control C
.equ CLKCTRL_MCLKINTCTRL = 0x0063        ; MCLK Interrupt Control
.equ CLKCTRL_MCLKINTFLAGS = 0x0064       ; MCLK Interrupt Flags
.equ CLKCTRL_MCLKSTATUS = 0x0065         ; MCLK Status
.equ CLKCTRL_OSCHFCTRLA = 0x0068         ; OSCHF Control A
.equ CLKCTRL_OSCHFTUNE = 0x0069          ; OSCHF Tune
.equ CLKCTRL_PLLCTRLA = 0x0070           ; PLL Control A
.equ CLKCTRL_OSC32KCTRLA = 0x0078        ; OSC32K Control A
.equ CLKCTRL_XOSC32KCTRLA = 0x007C       ; XOSC32K Control A
.equ CLKCTRL_XOSCHFCTRLA = 0x0080        ; 

;*************************************************************************
;** CPU - CPU
;*************************************************************************

